Repository: openstack-archive/deb-glance
Catalog: debian/po/*.po
Languages: fr

source: caching
fr: mise en cache

source: keystone+caching
fr: keystone + mise en cache

source: cachemanagement
fr: gestion du cache

source: keystone+cachemanagement
fr: keystone + gestion du cache

source: Pipeline flavor:
fr: Type d'acheminement des paquets :

source: Please specify the flavor of the pipeline to be used by Glance.
fr: Veuillez indiquer le type d'acheminement des paquets que Glance doit utiliser.

source: If you use the OpenStack Identity Service (Keystone), you might want to select "keystone". If you don't use this service, you can safely choose "caching" only.
fr: Si vous utilisez le Service d'Identité d'Openstack (Keystone), vous devriez choisir « keystone ». Si vous n'utilisez pas ce service, vous pouvez choisir sereinement « mise en cache » uniquement.

source: Authentication server hostname:
fr: Nom d'hôte du serveur d'authentification.

source: Please specify the hostname of the authentication server for Glance. Typically this is also the hostname of the OpenStack Identity Service (Keystone).
fr: Veuillez indiquer le nom d'hôte de votre serveur d'authentification pour Glance. Typiquement c'est également le nom d'hôte de votre Service d'Identité OpenStack (Keystone).

source: Authentication server tenant name:
fr: Nom d'espace client du serveur d'authentification :

source: Please specify the authentication server tenant name.
fr: Veuillez indiquer le nom de l'espace client du serveur d'authentification.

source: Authentication server username:
fr: Nom d'utilisateur pour le serveur d'authentification :

source: Please specify the username to use with the authentication server.
fr: Veuillez indiquer le nom d'utilisateur à utiliser sur le serveur d'authentification.

source: Authentication server password:
fr: Mot de passe pour le serveur d'authentification :

source: Please specify the password to use with the authentication server.
fr: Veuillez indiquer le mot de passe à utiliser sur le serveur d'authentification.

source: Set up a database for Glance?
fr: Installer une base de données pour Glance ?

source: No database has been set up for glance-registry or glance-api to use. Before continuing, you should make sure you have the following information:
fr: Aucune base de données n'a été installée pour le registre de glance ou pour l'API de Glance. Avant de continuer, assurez vous d'avoir :

source: * the type of database that you want to use; * the database server hostname (that server must allow TCP connections from this machine); * a username and password to access the database.
fr: - Le type de base de données que vous souhaitez utiliser ; - le nom d'hôte du serveur de base de données (ce serveur doit accepter les connexions TCP depuis cette machine); - un nom d'utilisateur et un mot de passe pour accéder à cette base de données.

source: If some of these requirements are missing, do not choose this option and run with regular SQLite support.
fr: Si certains de ces prérequis sont manquants, ignorer cette option et exécutez l'application avec le support SQLite normal.

source: You can change this setting later on by running "dpkg-reconfigure -plow glance-common".
fr: Vous pouvez modifier ce réglage plus tard en lançant « dpkg-reconfigure -plow glance-common ».

source: IP address of your RabbitMQ host:
fr: Adresse IP de votre hôte RabbitMQ :

source: In order to interoperate with other components of OpenStack, this package needs to connect to a central RabbitMQ server.
fr: Afin de pouvoir interagir avec d'autres composants d'OpenStack, ce paquet doit se connecter à un serveur centralisé RabbitMQ.

source: Please specify the IP address of that server.
fr: Veuillez indiquer l'adresse IP de ce serveur.

source: Username for connection to the RabbitMQ server:
fr: Nom d'utilisateur pour la connexion au serveur RabbitMQ :

source: Please specify the username used to connect to the RabbitMQ server.
fr: Veuillez indiquer le nom d'utilisateur à utiliser pour se connecter au serveur RabbitMQ.

source: Password for connection to the RabbitMQ server:
fr: Mot de passe pour la connexion au serveur RabbitMQ :

source: Please specify the password used to connect to the RabbitMQ server.
fr: Veuillez indiquer le mot de passe à utiliser pour se connecter au serveur RabbitMQ.

source: Register Glance in the Keystone endpoint catalog?
fr: Enregistrer Glance dans le catalogue de points d'accès de Keystone ?

source: Each OpenStack service (each API) should be registered in order to be accessible. This is done using "keystone service-create" and "keystone endpoint-create". This can be done automatically now.
fr: Chaque service OpenStack (chaque API) doit être enregistré pour être accessible. Cela peut être fait en utilisant « keystone service-create » et « keystone endpoint-create ». Cela peut maintenant être fait automatiquement.

source: Keystone server IP address:
fr: Adresse IP du serveur Keystone :

source: Please enter the IP address of the Keystone server, so that glance-api can contact Keystone to do the Glance service and endpoint creation.
fr: Veuillez indiquer l'adresse IP du serveur Keystone, pour que l'API de Glance puisse contacter Keystone pour établir le service Glance et créer le point d'accès.

source: Glance endpoint IP address:
fr: Adresse IP du point d'accès Glance :

source: Please enter the IP address that will be used to contact Glance.
fr: Veuillez indiquer l'adresse IP qui sera utilisée pour contacter Glance.

source: This IP address should be accessible from the clients that will use this service, so if you are installing a public cloud, this should be a public IP address.
fr: Cette adresse IP doit être accessible depuis les clients qui utiliseront ce service, donc si vous installez un nuage public, ce devra être une adresse IP publique.

source: Name of the region to register:
fr: Nom de la région à enregistrer :

source: OpenStack supports using availability zones, with each region representing a location. Please enter the zone that you wish to use when registering the endpoint.
fr: OpenStack supporte l'utilisation de zones disponibles, avec chaque région représentant un lieu. Veuillez entrer une zone que vous souhaitez utiliser lors de l'enregistrement d'un point d'accès.
